In [1]:
import pandas as pd 
import numpy as np

In [2]:
df = pd.read_excel('CS.xlsx' , sheet_name = 'Sheet1')
df.head(5)

  Object Name Display Date  Entered  Offer_Grade
0   Company_A   2019-01-01    18379            4
1   Company_B   2019-01-01     6590            2
2   Company_C   2019-01-01     7817            5
3   Company_D   2019-01-01     3349            4
4   Company_E   2019-01-01      623            5

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3655 entries, 0 to 3654
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Object Name   3655 non-null   object
 1   Display Date  3655 non-null   datetime64[ns]
 2   Entered       3655 non-null   int64
 3   Offer_Grade   3655 non-null   int64
dtypes: datetime64[ns](1), int64(2), object(1)
memory usage: 114.3+ KB

In [4]:
df.describe()

            Entered  Offer_Grade
count   3655.000000  3655.000000
mean    6611.372367     2.996717
std     5775.345825     1.415177
min       50.000000     1.000000
25%     2469.500000     2.000000
50%     5468.000000     3.000000
75%     8339.000000     4.000000
max    31292.000000     5.000000

In [17]:
df['Object Name'].unique()

array(['Company_A', 'Company_B', 'Company_C', 'Company_D', 'Company_E'],
      dtype=object)

In [9]:
df['Object Name'].value_counts()

Company_E    731
Company_C    731
Company_B    731
Company_D    731
Company_A    731
Name: Object Name, dtype: int64

In [11]:
df[df['Object Name']=='Company_E']['Entered'].max()

11371

In [12]:
df[['Entered','Offer_Grade']].corr()

             Entered  Offer_Grade
Entered      1.00000      0.23315
Offer_Grade  0.23315      1.00000

In [18]:
df['Offer_Grade'].unique()

array([4, 2, 5, 3, 1], dtype=int64)

In [19]:
df['Offer_Grade'].value_counts()

1    735
3    732
2    730
5    730
4    728
Name: Offer_Grade, dtype: int64

In [20]:
df.columns

Index(['Object Name', 'Display Date', 'Entered', 'Offer_Grade'], dtype='object')

In [22]:
#Second Tap

In [23]:
df = pd.read_excel('CS.xlsx' , sheet_name = 'Sheet2')
df.head(5)

  Display Date    Company  Number of Calls T  Number Of Agents  Offer_Grade
0   2019-01-01  Company_A             524812             801.0     3.032258
1   2019-02-01  Company_A             518488             700.0     4.071429
2   2019-03-01  Company_A             605318             586.0     4.451613
3   2019-04-01  Company_A             535728             672.0     3.533333
4   2019-05-01  Company_A             630067             757.0     4.483871

In [24]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 120 entries, 0 to 119
Data columns (total 5 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Display Date       120 non-null    datetime64[ns]
 1   Company            120 non-null    object
 2   Number of Calls T  120 non-null    int64
 3   Number Of Agents   120 non-null    float64
 4   Offer_Grade        120 non-null    float64
dtypes: datetime64[ns](1), float64(2), int64(1), object(1)
memory usage: 4.8+ KB

In [25]:
df.describe()

       Number of Calls T  Number Of Agents  Offer_Grade
count         120.000000        120.000000   120.000000
mean       201371.383333        372.883333     3.000286
std        172324.997298        320.606292     1.048703
min          8431.000000         13.855231     1.161290
25%         76961.750000        154.929786     2.316129
50%        172780.000000        291.881934     3.080645
75%        242063.000000        472.408944     3.838710
max        630067.000000       1084.000000     4.483871

In [26]:
df.columns

Index(['Display Date', 'Company', 'Number of Calls T', 'Number Of Agents',
       'Offer_Grade'],
      dtype='object')

In [27]:
df[['Number of Calls T','Offer_Grade']].corr()

                   Number of Calls T  Offer_Grade
Number of Calls T           1.000000     0.160463
Offer_Grade                 0.160463     1.000000

In [28]:
df[['Number of Calls T','Number Of Agents']].corr()

                   Number of Calls T  Number Of Agents
Number of Calls T           1.000000          0.941217
Number Of Agents            0.941217          1.000000

In [29]:
df[['Offer_Grade','Number Of Agents']].corr()

                  Offer_Grade  Number Of Agents
Offer_Grade           1.00000          -0.04373
Number Of Agents     -0.04373           1.00000